# FilterStringEndsWith Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterStringEndsWith Properties
FilterStringEndsWith Class See Also
---
The FilterStringEndsWith type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from FilterStringRuleEvaluator.) |

# See Also
FilterStringEndsWith Class
Autodesk.Revit.DB Namespace